[
  {
    "path": "posts/2021-05-29-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "DataViz Makeover 1 for ISSS608: Visual Analytics",
    "author": [
      {
        "name": "Tang Huining",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\n1.0 Critiques of the graph\r\nThe original visualisation can be seen below. \r\n1.1 Clarity\r\nThe mark on the region is not obvious enough, and it is difficult to confirm the name of the country during initial observation.\r\nThe date on the x-axis is not clear enough to determine the month included in the data. It is hard to know the month that the graph include. Therefore, data information cannot be obtained intuitively.\r\nThe range of the y-axis is different. In the graph of a certain country, the range of the y-axis is different, so the trade balance cannot be seen. In the same way, in different countries, the y-axis range is also different and it is impossible to intuitively compare the trade differences between different regions.\r\nThe type of graphic selection. In this figure, the part below the line chart is filled with color, but it is not conducive to observing the overall trend of change.\r\n1.2 Aesthetics\r\nChoice of color and transparency. Although the picture has a certain degree of transparency, it is very inconvenient to observe after the two colors are mixed, especially when the import is greater than the export, the export value is hidden.\r\nDifferent graph size. The six countries shown in this graph have different graph sizes in each country, so it is difficult to explore effective information from this graph.\r\nThe stacked form of graphics. Due to the large number of countries studied, the six graphs are stacked together in a 2*3 manner, which makes the originally small graphs smaller and more difficult to see subtle changes.\r\n2.0 Sketch of the proposed design\r\n2.1 Clarity\r\nNext, you will use the code chunk below to install and launch ggpubr and tidyverse in RStudio.\r\n2.2 Aesthetic\r\npackages = c(‘ggpubr’, ‘tidyverse’)\r\n3.0 Proposed Visualisation designed in Tableau\r\nPlease view the interactive visualisation on Tableau Public here\r\n4.0 A step-by-step description of how the data visualization was prepared\r\nDelete extra values in the original database using excel, change file name into import and export. \r\nImport the data into Tableau.Link two charts. \r\nChange data type to number. \r\nUse Tableau to pivot the data in both sheet. Drop measure values into columns and Measure names and country into rows. \r\nSelect all values from 2019 Jan to 2020 Dec from the Import/Export sheet, measure in sum. Delete other extra values.Do this in both sheets.\r\nView Data and export all data. \r\nRepeat the following steps for both Import and Export sections.Use Microsoft Excel to merge two files, add a new Type column to identify the type. \r\nImport the cleaned dataset into Tableau.Change column name into more clearer one. \r\nChange Date data type into ‘Date’. \r\n5.0 Three major observations revealed by the data visualisation prepared\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T19:38:07+08:00",
    "input_file": {}
  }
]
