[
  {
    "path": "posts/2021-06-20-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "DataViz Makeover 2 for ISSS608: Visual Analytics.",
    "author": [
      {
        "name": "Tang Huining",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\n1.0 Critiques of the graph\r\nThe original visualisation can be seen below.\r\n\r\n1.1 Clarity\r\nReference line. There is a lack of reference lines. Although we could know which country or region has a larger total amount, we can not tell the details of export and import.\r\n1.2 Aesthetics\r\nColor. Too many colors and some similar colors . Too many colors may cause confusion. In addition, there are some similar colors. For example, the colors of Mainland China are similar to the background, and the colors of EU and Thailand are indistinguishable.\r\nColor.\r\n2.0 Sketch of the proposed design\r\nWith reference to Critic , an alternative representation is sketched below. \r\n2.1 Clarity\r\nColor.\r\n2.2 Aesthetic\r\nColor.\r\n3.0 Proposed Visualisation designed in Tableau\r\nPlease view the interactive visualisation on Tableau Public here\r\n4.0 A step-by-step description of how the data visualization was prepared\r\nNo\r\nStep\r\nAction\r\n1\r\nUse Excel to delete redundant data. As we also consider the Europe Union, keep data from EU countries.There’re 34 country/region left.\r\n\r\n2\r\nAdd missing country of EU to T1 and T2\r\n\r\n3\r\nUse Tableau to import data and connect T1 and T2 with country\r\n\r\n4\r\nPivot the data of all dates in both T1 and T2\r\n\r\n5.0 Three major observations revealed by the data visualisation prepared\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T16:06:49+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-29-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "DataViz Makeover 1 for ISSS608: Visual Analytics",
    "author": [
      {
        "name": "Tang Huining",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\n1.0 Critiques of the graph\r\nThe original visualisation can be seen below. \r\n1.1 Clarity\r\nThe mark on the region is not obvious enough, and it is difficult to confirm the name of the country during initial observation.\r\nThe date on the x-axis is not clear enough to determine the month included in the data. It is hard to know the month that the graph include. Therefore, data information cannot be obtained intuitively.\r\nThe range of the y-axis is different. In the graph of a certain country, the range of the y-axis is different, so the trade balance cannot be seen. In the same way, in different countries, the y-axis range is also different and it is impossible to intuitively compare the trade differences between different regions.\r\nThe type of graphic selection. In this figure, the part below the line chart is filled with color, but it is not conducive to observing the overall trend of change.\r\n1.2 Aesthetics\r\nChoice of color and transparency. Although the picture has a certain degree of transparency, it is very inconvenient to observe after the two colors are mixed, especially when the import is greater than the export, the export value is hidden.\r\nDifferent graph size. The six countries shown in this graph have different graph sizes in each country, so it is difficult to explore effective information from this graph.\r\nThe stacked form of graphics. Due to the large number of countries studied, the six graphs are stacked together in a 2*3 manner, which makes the originally small graphs smaller and more difficult to see subtle changes.\r\n2.0 Sketch of the proposed design\r\nWith reference to Critic , an alternative representation is sketched below. \r\n2.1 Clarity\r\nChange the chart to a line chart makes it easier to compare the difference between imports and exports.\r\nThe year and month of the x-axis are clear, and the date can be adjusted at the same time, so that it is easy to find the exact date or time period.\r\nAdd the value of Monthly growth rate. We can see the trend of changes in imports and exports more intuitively\r\n2.2 Aesthetic\r\nArrange all countries horizontally to facilitate comparison between different countries. In addition, we can select any one or more countries.\r\nColour is used to bring to attention different Type, import or export.\r\nSeparate the statistics for the two years, and list the year at the top of the chart.\r\n3.0 Proposed Visualisation designed in Tableau\r\nPlease view the interactive visualisation on Tableau Public here\r\n4.0 A step-by-step description of how the data visualization was prepared\r\nDelete extra values in the original database using excel, change file name into import and export.\r\n\r\nImport the data into Tableau.Link two charts.\r\n 3. Change data type to number.\r\n 4. Use Tableau to pivot the data in both sheet. Drop measure values into columns and Measure names and country into rows.\r\n 5. Select all values from 2019 Jan to 2020 Dec from the Import/Export sheet, measure in sum. Delete other extra values.Do this in both sheets.  6. View Data and export all data.\r\n 7. Repeat the following steps for both Import and Export sections.Use Microsoft Excel to merge two files, add a new Type column to identify the type.\r\n 8. Import the cleaned dataset into Tableau.Change column name into more clearer one.\r\n 9. Change Date data type into ‘Date’.\r\n 10.Add Country, Date(YEAR) and Date(Month) to the Column tab and Sum(Value) to the Rows tab.\r\n 11. Add a filter to seperate the import and export value.\r\n 12. Add a filter to choose the range of date.\r\n 13. Add another filter to compare difference between countries.\r\n 14. Drop Value(in thousand) to the Rows tab, use quick table calculation to get the mongthly growth rate.\r\n\r\n15.The base graph should look like this.\r\n\r\n16.Change the title of the chart.\r\n17.Change the month on the x-axis into number to make the graph clearer.\r\n18.Change the name of y-axis.\r\n19.Adjust the size of the picture so that more countries can be seen on the interface under the condition of being able to see clearly.\r\n20.Change the tooltip.  21. The tooltip will look like below.\r\n 21. The final dashboard.\r\n\r\n5.0 Three major observations revealed by the data visualisation prepared\r\nThe export value of Hong Kong and Taiwan is obviously greater than the import value, and there is a trade surplus. The foreign trade of these two countries is in a favorable position. But this may affect a country’s currency to some extent.\r\nIn general, the imports and exports of commodities in the remaining countries have an upward trend, of which Taiwan and China have the most obvious upward trends. It is worth noting that in the first quarter of 2020, the import and export of merchandise in different countries all have a certain degree of decline, of which Malaysia has the largest volatility. This may be related to the COVID-19 outbreak in early 2020.\r\nThe monthly changes in imports and exports are similar.The monthly changes in imports and exports are similar. Judging from the changes in the monthly growth rate in the figure, the imports and exports of countries usually increase or decrease at similar rates. In addition to national macro-control factors, trade between countries also has mutual influence. This also shows that the ratio of a country’s imports and exports is basically maintained in a stable range.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T23:32:46+08:00",
    "input_file": {}
  }
]
